import React from "react";
import "./HomePage.css";
import { motion } from "framer-motion";
import { Link } from "react-router-dom";

function LecturePage() {
  return (
    <div className="lecture-page">
      {/* Header Section */}
      <div className="header">
        <div className="logo">
          <img src="logo.png" alt="Website Logo" />
          <h2>Вбережи Життя</h2>
        </div>
        <div className="menu">
          <ul>
            <li>
              <Link to="/">Головна</Link>
            </li>
            <li>
              <Link to="/lecture">Порядок ДМД</Link>{" "}
            </li>
            <li>
              <Link to="/algorithm">Алгоритм</Link>{" "}
            </li>
            <li>
              <Link to="/resources">Ресурси</Link>
            </li>
            <li>
              <Link to="/contact">Про нас</Link>{" "}
            </li>
          </ul>
        </div>
      </div>

      {/* Welcome Section */}
      <motion.div
        className="lecture-start"
        initial={{ opacity: 0, y: 20 }}
        animate={{ opacity: 1, y: 0 }}
        transition={{ duration: 1 }}
      >
        <p style={{ textAlign: "end", fontSize: "22px" }}>
          <b>
            ЗАТВЕРДЖЕНО
            <br /> Наказ Міністерства
            <br /> охорони здоров’я України
            <br /> 09 березня 2022 року № 441
          </b>
        </p>
        <p>
          <b style={{ fontSize: "32px" }}>
            ПОРЯДОК <br />
            надання домедичної допомоги постраждалим при термічних опіках
          </b>{" "}
        </p>{" "}
        <p style={{ textAlign: "justify", fontSize: "24px" }}>
          <ol>
            <li>
              {" "}
              Цей Порядок визначає механізм надання домедичної допомоги
              постраждалим при термічних опіках особами, які не мають медичної
              освіти, але за своїми службовими обов’язками повинні надавати
              домедичну допомогу.
            </li>
            <li>
              {" "}
              У цьому Порядку термін «термічний опік» вживається у такому
              значенні - це невідкладний стан, спричинений дією високих
              температур, в результаті чого виникає пошкодження шкіри та м’яких
              тканин. <br /> Інші терміни вживаються у значеннях, наведених в
              Законі України «Основи законодавства України про охорону здоров’я»
              та інших нормативно-правових актах у сфері охорони здоров’я.{" "}
            </li>
            <li>
              При наданні домедичної допомоги враховувати ступінь пошкодження
              шкіри та м’яких тканин:{" "}
              <ol>
                <li>
                  I ступінь (еритема) - почервоніння шкіри, набряклість і біль;{" "}
                </li>

                <li>
                  II ступінь (утворення пухирів) - сильний біль із інтенсивним
                  почервонінням, відшаруванням епідермісу з утворенням міхурів,
                  наповнених рідиною;{" "}
                </li>
                <li>
                  III ступінь: пошкодження всієї товщі шкіри з утворенням
                  щільного струпу, під яким перебувають ушкоджені тканини;{" "}
                </li>
                <li>
                  IV ступінь (обвуглення): пошкодження всієї товщі шкіри з
                  ушкодження м’язів, сухожиль, кісток.{" "}
                </li>
              </ol>
            </li>
            <li>
              Послідовність дій при наданні домедичної допомоги постраждалим при
              термічних опіках:
              <ol>
                <li>
                  {" "}
                  перед наданням допомоги переконатися у відсутності небезпеки
                  для себе, оточуючих, постраждалого та тільки за її відсутності
                  перейти до наступного кроку;{" "}
                </li>
                <li>
                  припинити дію високої температури на постраждалого, при
                  необхідності зняти тліючий одяг;{" "}
                </li>
                <li> зняти прикраси, які є на ділянці опіку; </li>
                <li>
                  заспокоїти постраждалого та пояснити свої подальші дії;
                </li>{" "}
                <li>
                  здійснити виклик екстреної медичної допомоги та дотримуватись
                  вказівок диспетчера прийому виклику;
                </li>
                <li>
                  {" "}
                  охолодити місце опіку шляхом промивання протягом щонайменше 20
                  хвилин водою кімнатної температури, якщо площа опіку не
                  перевищує 20 % у дорослих або 10 % у дітей;{" "}
                </li>
                <li>
                  {" "}
                  після охолодження накласти на місце опіку чисту, стерильну
                  суху марлеву пов’язку. Пов’язка не повинна здійснювати тиск на
                  м’які тканини;
                </li>
                <li>
                  за наявності міхурів не слід їх пошкоджувати. При випадковому
                  пошкодженні міхурів накласти пов’язки, як описано вище;
                </li>
                <li>
                  {" "}
                  при опіках більше ніж 20 % площі тіла у дорослих або 10 % у
                  дітей потрібно накрити постраждалого
                  термопокривалом/покривалом;{" "}
                </li>
                <li>
                  {" "}
                  забезпечити постійний нагляд за постраждалим до приїзду
                  бригади екстреної (швидкої) медичної допомоги;
                </li>
                <li>
                  {" "}
                  при погіршенні стану постраждалого до приїзду бригади
                  екстреної (швидкої) медичної допомоги повторно зателефонувати
                  диспетчеру екстреної медичної допомоги;{" "}
                </li>
                <li>
                  {" "}
                  за можливості зібрати у постраждалого чи оточуючих максимально
                  можливу інформацію стосовно обставин отримання травми. Всю
                  отриману інформацію передати фахівцям бригади екстреної
                  (швидкої) медичної допомоги або диспетчеру служби екстреної
                  медичної допомоги.
                </li>
              </ol>
            </li>
            <li>
              {" "}
              Якщо до приїзду бригади екстреної (швидкої) медичної допомоги
              постраждалий втратив свідомість, слід перейти до Порядку надання
              домедичної допомоги дорослим при раптовій зупинці кровообігу або
              Порядку надання домедичної допомоги дітям при раптовій зупинці
              кровообігу, затверджених наказом Міністерства охорони здоров’я
              України від 09 березня 2022 року № 441.{" "}
            </li>{" "}
          </ol>{" "}
          <b style={{ pading: "40px" }}>
            {" "}
            Генеральний директор <br /> Директорату медичних послуг{" "}
          </b>
        </p>
        <p style={{ textAlign: "right" }}>
          {" "}
          <b>О. Машкевич </b>
        </p>
      </motion.div>

      <div className="bottom-info">
        <p>&copy; {new Date().getFullYear()} Вбережи Життя || Preserve Life</p>
        <p>Created by: Dana_boo (Maliarchuk Bohdana) and Tsymbaliuk Tetiana</p>
        <p>
          <Link to="/">Головна</Link> | <Link to="/contact">Про Нас</Link>
        </p>
      </div>
    </div>
  );
}

export default LecturePage;
